app/controllers/microposts_controller.rb

  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save
---
INSERT INTO "microposts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "Post Testowy\r\n"], ["created_at", Sat, 12 Apr 2014 13:10:19 UTC +00:00], ["updated_at", Sat, 12 Apr 2014 13:10:19 UTC +00:00], ["user_id", 2]]