app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(page: params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0  [["user_id", 2]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 2]]

  def update
    if @user.update_attributes(user_params)
---
UPDATE "users" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 4  [["name", "Testy"], ["password_digest", "$2a$10$N9oJTlHVX1xr8iBpiLDvnO2/Te98yVU7FlZnbkBr6DNO/7yXlb9gK"], ["updated_at", Sat, 17 May 2014 12:30:42 UTC +00:00]]

  def following
    @title = "Polubienia"
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]

  def followers
    @title = "Polubiający"
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]